NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : r_qetouch_rx.c
* Description  : This module implements the QE TOUCH API
***********************************************************************************************************************/

/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              :            0.99    Jim Page: Changed GAIN_100 to 1 (sets TUNING_UPPER/LOWER_LIMIT to 200/150)
*              : 04.10.2018 1.00    First Release
*              : 09.07.2019 1.10    Moved TUNING_UPPER/LOWER_LIMIT #defines to private.h.
*                                   Created enhanced algorithm for performing offset tuning and calculating reference
*                                     counts and moved this processing into Open().
*                                   Added TOUCH_CMD_GET_FAILED_SENSOR and TOUCH_CMD_GET_LAST_SCAN_METHOD
*                                     Control() commands.
*                                   Added r_touch_control_private().
*                                   Closed ext trigger timing window bug by adding disable/enable CTSU interrupts.
*                                   Removed g_correction_create error checking in touch_data_moving_average() because
*                                     Open() will return error prior to that check ever being reached.
*                                   Added error checking to correction_sensor_magnification_set() switch default.
*                                   Modified R_TOUCH_UpdateData() so it can be called when using software triggers.
*                                     (User will need to call R_CTSU_StartScan() in this case, like low power).
*                                   Added #pragma sections and removed g_calib_info[][].
*                                   Modified for GCC/IAR compatibility.
*              : 09.01.2020 1.11    Added Control() command TOUCH_CMD_CLEAR_TOUCH_STATES for low power applications.
*                                   Added control_private() command TOUCH_PCMD_CLEAR_TUNING_FLAGS.
*                                   Added API function R_TOUCH_GetBtnBaselines.
*                                   Added error code QE_ERR_UNSUPPORTED_CLK_CFG to R_TOUCH_Open().
***********************************************************************************************************************/

/***********************************************************************************************************************
* Includes
***********************************************************************************************************************/
#include <string.h>
#include "platform.h"
#include "r_touch_qe_if.h"
#include "r_touch_qe_private.h"
#include "qe_common.h"
#include "r_ctsu_qe_if.h"
#include "r_ctsu_qe_private.h"
#include "r_monitor.h"

#if (TUNING_UPPER_LIMIT > 500)
#error "TUNING_UPPER_LIMIT in r_touch_qe_private.h is too large."
#endif

#if (TUNING_LOWER_LIMIT > 500)
#error "TUNING_LOWER_LIMIT in r_touch_qe_private.h is too large."
#endif

#if (OT_MAX_SCAN_ATTEMPTS > 255)
#error "OT_MAX_SCAN_ATTEMPTS in touch_qe_private.h is too large"
#endif


/***********************************************************************************************************************
* Macro definitions
***********************************************************************************************************************/
#define TOUCH_PRV_0_SUCCESS         (0)
#define TOUCH_PRV_1_ERROR           (1)

#define TOUCH_PRV_SO0_OFFSET_MASK   (0x3FF)

#define TOUCH_PRV_ADD_TIME          (4)

#define TOUCH_PRV_0_BUTTON          (0)
#define TOUCH_PRV_1_MATRIX          (1)
#define TOUCH_PRV_2_SLIDER          (2)
#define TOUCH_PRV_3_WHEEL           (3)

#define TOUCH_PRV_LEVEL_USE_MAX_ADJ (1000)      /* level beyond which should tune with larger adjustments (arbitrary value) */

/***********************************************************************************************************************
* Typedef definitions
***********************************************************************************************************************/


/***********************************************************************************************************************
* Exported global variables
***********************************************************************************************************************/
self_ico_t      *g_self_ico_data_pt[QE_NUM_METHODS];       // ptr to ctsu scan buffer
self_ico_t      *g_self_raw_data_pt[QE_NUM_METHODS];       // ptr to copied ctsu scan buffer data
uint16_t        *g_self_ico_sensor_pt[QE_NUM_METHODS];     // ptr into ctsu scan buffer
uint16_t        *g_self_add_sensor_pt[QE_NUM_METHODS];     // ptr to a buffer for moving average calculation
uint16_t        *g_self_sensor_cnt_pt[QE_NUM_METHODS];     // ptr to another buffer for moving average calculation

mutual_ico_t    *g_mutual_ico_data_pt[QE_NUM_METHODS];
mutual_ico_t    *g_mutual_raw_data_pt[QE_NUM_METHODS];
uint16_t        *g_mutual_ico_pri_sensor_pt[QE_NUM_METHODS];
uint16_t        *g_mutual_ico_snd_sensor_pt[QE_NUM_METHODS];
uint16_t        *g_mutual_add_pri_sensor_pt[QE_NUM_METHODS];
uint16_t        *g_mutual_add_snd_sensor_pt[QE_NUM_METHODS];
uint16_t        *g_mutual_sensor_diff_pt[QE_NUM_METHODS];

int8_t          *g_current_sign_pt[QE_NUM_METHODS];

key_info_t          g_key_info[QE_NUM_METHODS];
touch_group_param_t g_touch_key_group[QE_NUM_METHODS];
touch_tuning_t      g_touch_tuning_info[QE_NUM_METHODS];

touch_func_flag_t   g_touch_function[QE_NUM_METHODS];
touch_result_t      g_touch_all_result[QE_NUM_METHODS];
touch_func_param_t  g_touch_paramter[QE_NUM_METHODS];
volatile uint8_t    g_data_tim;                         /* Calibration data storage times */

uint16_t        g_slider_data[QE_SLIDER_MAX_ELEMENTS];
uint16_t        g_wheel_data[QE_WHEEL_MAX_ELEMENTS];
uint8_t         g_method_stor=0;
uint8_t         g_open_num_methods;
touch_mlist_t   g_mlist;

ctsu_cfg_t      **gp_ctsu_configs;      // ptr to array of ctsu configurations
touch_cfg_t     **gp_touch_configs;     // ptr to array of touch configurations
sldr_ctrl_t     *gp_sliderInfo;
wheel_ctrl_t    *gp_wheelInfo;


