NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
/***********************************************************************************************************************
* Private global variables and functions
***********************************************************************************************************************/
static touch_sensor_t   g_bad_sensor;   // offset tuning error details

static qe_trig_t    g_trigger;
static bool         g_cycle_methods;
static uint8_t      g_set_method;
static uint8_t      g_last_method;

static uint16_t R_Set_Cap_Touch_Result_Create(uint8_t method);
static uint16_t R_Get_Cap_Touch_Sensor_Data(uint8_t method, uint8_t mode, uint8_t index_num);
static void     touch_data_moving_average(uint8_t method);
static qe_err_t correction_sensor_magnification_set(uint8_t method);
static qe_err_t method_offset_tuning(uint8_t method);
static qe_err_t get_ctsu_err(uint8_t method, ctsu_status_t ctsu_status);
static uint16_t correction_sensor_cnt_create(uint8_t method, uint8_t ts_num, uint8_t number);
static uint16_t correction_pri_sensor_cnt_create(uint8_t method, uint8_t ts_num, uint8_t number);
static uint16_t correction_snd_sensor_cnt_create(uint8_t method, uint8_t ts_num, uint8_t number);
static qe_err_t update_data(void);
static qe_err_t r_touch_control_private(touch_pcmd_t pcmd, void *p_arg);


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif/***********************************************************************************************************************
* Function Name: R_TOUCH_Open
* Description  : This functions Open()s the CTSU, and initializes all data for the Touch layer.
* Arguments    : p_ctsu_cfgs -
*                    Pointer to array of method configurations for the CTSU driver
*                p_touch_cfgs -
*                    Pointer to array of method configurations for the Touch driver
*                num_methods -
*                    Number of methods in arrays
*                trigger -
*                    CTSU scan trigger type
* Return Value : QE_SUCCESS -
*                    API initialized successfully.
*                QE_ERR_NULL_PTR
*                    Missing argument pointer
*                QE_ERR_INVALID_ARG -
*                    Number of methods or trigger type is invalid.
*                QE_ERR_ALREADY_OPEN -
*                    CTSU already open.
*                QE_ERR_BUSY -
*                    CTSU already open and busy running.
*                QE_ERR_UNSUPPORTED_CLK_CFG-
*                    Unsupported clock configuration.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan for correction or offset tuning
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan for correction or offset tuning
*                QE_ERR_SENSOR_SATURATION -
*                    Initial sensor value beyond linear portion of correction curve.
*                QE_ERR_OT_MAX_OFFSET -
*                    Cannot tune SO0 offset any higher
*                QE_ERR_OT_MIN_OFFSET -
*                    Cannot tune SO0 offset any lower
*                QE_ERR_OT_WINDOW_SIZE -
*                    Tuning window too small. SO0 adjustments keep counts outside of window.
*                QE_ERR_OT_MAX_ATTEMPTS -
*                    Maximum scans performed and all sensors still not in target window.
*                QE_ERR_UNSUPPORTED_CLK_CFG -
*                   Unsupported clock speed. Cannot perform CTSU correction.
***********************************************************************************************************************/
qe_err_t R_TOUCH_Open(ctsu_cfg_t *p_ctsu_cfgs[], touch_cfg_t *p_touch_cfgs[], uint8_t num_methods, qe_trig_t trigger)
{
    qe_err_t    err=QE_SUCCESS;
    uint8_t     i;
    uint8_t     method;
#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((NULL == p_ctsu_cfgs) || (NULL == p_touch_cfgs))
    {
        return QE_ERR_NULL_PTR;
    }

    if ((num_methods > QE_NUM_METHODS) || (trigger >= QE_TRIG_END_ENUM))
    {
        return QE_ERR_INVALID_ARG;
    }

    /* Do not parameter check configuration contents generated by QE Tool. */
#endif

    /* Copy initialized safety critical data from "D" ROM section into "R" RAM section */
#if ((defined(__CCRX__)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
    memcpy(__sectop("R_QE_TOUCH_SAFETY_RAMINIT"), __sectop("D_QE_TOUCH_SAFETY_RAMINIT"),
                ((uint32_t)__secend("D_QE_TOUCH_SAFETY_RAMINIT") - (uint32_t)__sectop("D_QE_TOUCH_SAFETY_RAMINIT")));
    memcpy(__sectop("R_QE_TOUCH_SAFETY_RAMINIT_2"), __sectop("D_QE_TOUCH_SAFETY_RAMINIT_2"),
               ((uint32_t)__secend("D_QE_TOUCH_SAFETY_RAMINIT_2") - (uint32_t)__sectop("D_QE_TOUCH_SAFETY_RAMINIT_2")));
#endif
    g_open_num_methods = num_methods;
    g_trigger = trigger;


    /* initialize system pointers */

    touch_parameter_address_set();
    ctsu_sensor_data_address_set();
#if (TOUCH_CFG_UPDATE_MONITOR == 1)
    monitor_init();
#endif

    /* open CTSU driver */
    err = R_CTSU_Open(p_ctsu_cfgs, num_methods, trigger);
    if (QE_SUCCESS == err)
    {
        touch_parameter_set(p_ctsu_cfgs, p_touch_cfgs);

        /* by default, set Touch to cycle through all methods, starting with method 0 */
        g_mlist.num_methods = num_methods;
        g_cycle_methods = true;
        for (i=0; i < num_methods; i++)
        {
            g_mlist.methods[i] = i;
        }

        if (1 == num_methods)
        {
            g_cycle_methods = false;
        }

        /* set up global pointers for method 0 */
        method = 0;
        g_method_stor = method;
        g_set_method = method;
        gp_ctsu_configs = p_ctsu_cfgs;
        gp_touch_configs = p_touch_cfgs;
        gp_sliderInfo = p_touch_cfgs[method]->p_sliders;
        gp_wheelInfo = p_touch_cfgs[method]->p_wheels;

        /* perform offset tuning and set button reference values */
        err = r_touch_control_private(TOUCH_PCMD_PERFORM_OFFSET_TUNING, NULL);

        if ((QE_SUCCESS == err) || (QE_ERR_OT_MAX_ATTEMPTS == err))
        {
            R_CTSU_Control(CTSU_CMD_SET_METHOD, 0, NULL);   // stay opened; set to method 0
        }
        else
        {
            R_CTSU_Close();
        }
    }
    else
    {
        g_bad_sensor.method = 0;            // correction uses method 0's scan buffer
        g_bad_sensor.element = 0;           // correction operates on first element only
    }

