NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
    return err;
} /* End of function R_TOUCH_Open() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: method_offset_tuning
* Description  : This function fine tunes the CTSU SO0 register for each sensor. It will perform up to
*                OT_MAX_SCAN_ATTEMPTS to get all sensors within its no-touch target range.
* Arguments    : method -
*                    Method to fine tune (gp_ctsu_configs[] and gp_touch_cfgs[] index)
* Return Value : QE_SUCCESS -
*                    All sensors in the method were fine tuned successfully.
*                QE_ERR_BUSY -
*                    CTSU busy. Likely this function called via main loop (outside Open) while another scan is running.
*                QE_ERR_UNSUPPORTED_CLK_CFG-
*                    Unsupported clock configuration.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan
*                QE_ERR_OT_MAX_OFFSET -
*                    Cannot tune SO0 offset any higher
*                QE_ERR_OT_MIN_OFFSET -
*                    Cannot tune SO0 offset any lower
*                QE_ERR_OT_WINDOW_SIZE -
*                    Tuning window too small. SO0 adjustments keep counts outside of window.
*                QE_ERR_OT_MAX_ATTEMPTS -
*                    Maximum scans performed and all sensors still not in target window.
***********************************************************************************************************************/
static qe_err_t method_offset_tuning(uint8_t method)
{
    qe_err_t err = QE_SUCCESS;
    uint8_t  i;
    uint8_t  j;
    uint8_t  num_elements;
    uint8_t  num_tuned;
    uint16_t ref_cnt;
    uint16_t sensor_cnt;
    uint16_t so0_reg_val;
    uint16_t so0_offset;
    uint16_t so0_min_adj;           // so0 increment/decrement amount if sensor within 1000 counts of target
    uint16_t so0_max_adj;           // so0 increment/decrement amount if sensor over 1000 counts of target
    ctsu_state_t    ctsu_state;
    ctsu_status_t   ctsu_status;


    /* init variables */

    g_bad_sensor.method = method;
    num_elements = gp_ctsu_configs[method]->num_elements;
    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        ref_cnt = QE_07_2UA;
        so0_min_adj = 1;
        so0_max_adj = 2;
    }
    else /* mutual mode */
    {
        ref_cnt = QE_04_8UA;
        so0_min_adj = 2;
        so0_max_adj = 4;
    }


    /* SCAN UNTIL ALL SENSORS TUNED OR MAX ATTEMPTS REACHED */

    /* allow software scans if external trigger configured; do not call user callback function */
    r_ctsu_control_private(CTSU_PCMD_SET_OFFSET_TUNING_FLG, method, NULL);

    for (j=0; j < OT_MAX_SCAN_ATTEMPTS; j++)
    {
        /* START SCAN AND WAIT FOR COMPLETION */

        err = R_CTSU_StartScan();
        if (QE_ERR_BUSY == err)     // function called outside of Open() likely while another scan is running
        {
            break;
        }

        do
        {
            R_CTSU_Control(CTSU_CMD_GET_STATE, method, &ctsu_state);
        } while (CTSU_STATE_READY != ctsu_state);


        /* CHECK FOR HARDWARE SCAN ERRORS */
        R_CTSU_Control(CTSU_CMD_GET_STATUS, method, &ctsu_status);
        if (1 != ctsu_status.flag.data_update)
        {
            err = get_ctsu_err(method, ctsu_status);
            break;
        }

        /* Check for bad clock configuration */
        err = correction_sensor_magnification_set(method);
        if (QE_SUCCESS != err)
        {
            break;
        }


        /* PROCESS ALL UNTUNED ELEMENTS */

        /* get filtered (averaged) count values with correction applied for all elements */
        touch_data_moving_average(method);

        /* for each element */
        for (i=0, num_tuned=0; i < num_elements; i++ )
        {
            /* if current element not yet fine tuned */
            if (OT_WINDOW_TUNE_COUNT != g_touch_tuning_info[method].result[i])
            {
                /* get sensor count */
                if (TOUCH_SELF_MODE == g_key_info[method].mode)
                {
                    sensor_cnt = g_self_add_sensor_pt[method][i];
                }
                else /* mutual mode */
                {
                    sensor_cnt = g_mutual_add_pri_sensor_pt[method][i];
                }

                /* get SO0 offset value for sensor from CTSU */
                R_CTSU_ReadReg(CTSU_REG_SO0, i, &so0_reg_val);
                so0_offset = so0_reg_val & TOUCH_PRV_SO0_OFFSET_MASK;
                so0_reg_val &= (~TOUCH_PRV_SO0_OFFSET_MASK);

                /* if sensor count too high */
                if (sensor_cnt > (ref_cnt + TUNING_UPPER_LIMIT))
                {
                    /* if SO0 offset not maxed out */
                    if (0x3FF != so0_offset)
                    {
                        /* increment SO0 and write to CTSU */
                        if ((sensor_cnt > (ref_cnt + TOUCH_PRV_LEVEL_USE_MAX_ADJ)) && ((so0_offset + so0_max_adj) <= 0x3FF))
                        {
                            so0_offset += so0_max_adj;
                        }
                        else if ((so0_offset + so0_min_adj) <= 0x3FF)
                        {
                            so0_offset += so0_min_adj;
                        }
                        else
                        {
                            so0_offset++;
                        }

                        so0_reg_val |= so0_offset;
                        R_CTSU_WriteReg(CTSU_REG_SO0, i, so0_reg_val);

                        /* if change in direction, increment change count */
                        if (CTSUSO_INCREMENTING != g_touch_tuning_info[method].ctsuso[i])
                        {
                            g_current_sign_pt[method][i] += 1;
                        }
                        g_touch_tuning_info[method].ctsuso[i] = CTSUSO_INCREMENTING;    // set direction
                    }
                    else
                    {
                        err = QE_ERR_OT_MAX_OFFSET;
                        break;
                    }
                }
                /* else if sensor count too low */
                else if (sensor_cnt < (ref_cnt - TUNING_LOWER_LIMIT))
                {
                    /* if SO0 offset not already at min */
                    if (0 != so0_offset)
                    {
                        /* decrement SO0 and write to CTSU */
                        if ((sensor_cnt < (ref_cnt - TOUCH_PRV_LEVEL_USE_MAX_ADJ)) && ((so0_offset - so0_max_adj) >= 0))
                        {
                            so0_offset -= so0_max_adj;
                        }
                        else if ((so0_offset - so0_min_adj) >= 0)
                        {
                            so0_offset -= so0_min_adj;
                        }
                        else
                        {
                            so0_offset--;
                        }

