NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
                        so0_reg_val |= so0_offset;
                        R_CTSU_WriteReg(CTSU_REG_SO0, i, so0_reg_val);

                        /* if change in direction, increment change count */
                        if (CTSUSO_DECREMENTING != g_touch_tuning_info[method].ctsuso[i])
                        {
                            g_current_sign_pt[method][i] += 1;
                        }
                        g_touch_tuning_info[method].ctsuso[i] = CTSUSO_DECREMENTING;    // set direction
                    }
                    else
                    {
                        err = QE_ERR_OT_MIN_OFFSET;
                        break;
                    }
                }
                else
                {
                    /* else sensor between upper and lower limits*/
                    g_touch_tuning_info[method].result[i]++;
                    if (OT_WINDOW_TUNE_COUNT == g_touch_tuning_info[method].result[i])
                    {
                        num_tuned++;
                    }
                }

                /* if changed direction more than twice, tuning window too small */
                if (3 == g_current_sign_pt[method][i])
                {
                    err = QE_ERR_OT_WINDOW_SIZE;
                    break;
                }
            }
            else
            {
                num_tuned++;
            }
        } // end element tuning loop


        /* if an error was detected, stop scanning */
        if (QE_SUCCESS != err)
        {
            g_bad_sensor.element = i;
            break;
        }

        /* if all sensors tuned, stop scanning */
        if (num_tuned == num_elements)
        {
            g_touch_function[method].flag.tuning = 1;               // tuning complete for method
            break;
        }
    } // end scan attempt loop


    r_ctsu_control_private(CTSU_PCMD_CLR_OFFSET_TUNING_FLG, method, NULL);   // restore original triggering as appropriate

    /* if all sensors tuned, set reference values for BUTTONS to moving average */
    if (1 == g_touch_function[method].flag.tuning)
    {
        for (i=0; i < gp_touch_cfgs[method]->num_buttons; i++)
        {
            j = gp_touch_cfgs[method]->p_buttons[i].elem_index;
            if (TOUCH_SELF_MODE == g_key_info[method].mode)
            {
                g_key_info[method].ref[i] = g_self_add_sensor_pt[method][j];
            }
            else
            {
                g_key_info[method].ref[i] = g_mutual_sensor_diff_pt[method][j];
            }
        }
    }
    else if (j >= OT_MAX_SCAN_ATTEMPTS)
    {
        err = QE_ERR_OT_MAX_ATTEMPTS;

        /* find 1st of 1+ untuned elements */
        for (i=0; i < num_elements; i++)
        {
            if (0 == g_touch_tuning_info[method].result[i])
            {
                break;
            }
        }

        g_bad_sensor.element = i;
    }
    else
    {
        ;   // coding standard requirement
    }

    return err;
} /* End of function method_offset_tuning() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: get_ctsu_err
* Description  : This functions checks the CTSU status flags for a hardware scan error. If one is detected, the
*                specific sensor at fault is identified if possible and is loaded into g_bad_sensor. This can be
*                retrieved later by the user with the Control() command TOUCH_CMD_GET_FAILED_SENSOR.
* Arguments    : method -
*                    Scan method index
*                ctsu_status
*                    CTSU status flags from scan
* Return Value : QE_SUCCESS -
*                    No hardware error detected
*                QE_ERR_ABNORMAL_TSCAP -
*                    TSCAP error detected.
*                QE_ERR_SENSOR_OVERFLOW -
*                    Sensor overflow detected.
***********************************************************************************************************************/
static qe_err_t get_ctsu_err(uint8_t method, ctsu_status_t ctsu_status)
{
    qe_err_t    err = QE_SUCCESS;
    uint8_t     i;
    uint8_t     index_multiplier;
    uint8_t     num_elements = gp_ctsu_configs[method]->num_elements;


    g_bad_sensor.method = method;
    index_multiplier = (TOUCH_SELF_MODE == g_key_info[method].mode) ? 2 : 4;

    if (ctsu_status.flag.icomp_error)       // TSCAP error
    {
        for (i=0; i < num_elements; i++)
        {
            /* One possible cause of a TSCAP error is an unconfigured pin. This gives a sensor count at or near 0. */
            if (gp_ctsu_configs[method]->p_scan_buf[i*index_multiplier] < 10)
            {
                break;
            }
        }

        g_bad_sensor.element = i;
        err = QE_ERR_ABNORMAL_TSCAP;
    }

    else if (ctsu_status.flag.sens_over)    // sensor overflow error
    {
        for (i=0; i < num_elements; i++)
        {
            if (0xFFFF == gp_ctsu_configs[method]->p_scan_buf[i*index_multiplier])
            {
                break;
            }
        }

        g_bad_sensor.element = i;
        err = QE_ERR_SENSOR_OVERFLOW;
    }
    else
    {
        ;   // coding standard requirement
    }

    return err;
} /* End of function get_ctsu_err() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_UpdateDataAndStartScan
* Description  : This function is used when software-trigger is specified at Open(). It should be called each time
*                a periodic timer expires. This function updates the sensor data, determines if any touches occurred,
*                sets the method to be run on the next scan if appropriate, and starts another scan.
* Arguments    : None
* Return Value : QE_SUCCESS -
*                    API initialized successfully.
*                QE_ERR_TRIGGER_TYPE -
*                    This function should not be called when using external triggers
*                QE_ERR_BUSY -
*                    CTSU busy. Likely need more time between calling this function/starting scans.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan
***********************************************************************************************************************/
qe_err_t R_TOUCH_UpdateDataAndStartScan(void)
{
    qe_err_t    err=QE_SUCCESS;


    if (QE_TRIG_EXTERNAL == g_trigger)
    {
        return QE_ERR_TRIGGER_TYPE;
    }

    err = update_data();
    if (QE_ERR_BUSY != err)
    {
        R_CTSU_StartScan();
    }

