NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
    return err;

} /* End of function R_TOUCH_UpdateDataAndStartScan() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_UpdateData
* Description  : This function is used when external-trigger is specified at Open(), when only a single method is
*                running due to a TOUCH_CMD_SET_METHOD, or non-periodic scanning is implemented. It should be called
*                each time a scan completes. This function updates the sensor data, determines if any touches occurred,
*                and sets the method to be run on the next scan if appropriate.
* Arguments    : None
* Return Value : QE_SUCCESS -
*                    API initialized successfully.
*                QE_ERR_BUSY -
*                    CTSU busy. Likely need more time between calling this function/starting scans.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan
***********************************************************************************************************************/
qe_err_t R_TOUCH_UpdateData(void)
{
    qe_err_t    err=QE_SUCCESS;

    err = update_data();

    return err;

} /* End of function R_TOUCH_UpdateData() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: update_data
* Description  : This function 1) Saves the raw scan data, applies correction and filter (4-deep moving average), then
*                2) Determines if any buttons, sliders, or wheels were touched and calculates results, and 3) Determines
*                if the method needs to be changed before the next scan starts, either because methods are being cycled
*                through or a TOUCH_CMD_SET_METHOD command changed the desired method.
* Arguments    : None
* Return Value : QE_SUCCESS -
*                    API initialized successfully.
*                QE_ERR_BUSY
*                    CTSU busy. Likely need more time between calling this function/starting scans.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan
***********************************************************************************************************************/
static qe_err_t update_data(void)
{
    qe_err_t        err=QE_SUCCESS;
    ctsu_status_t   ctsu_status;
    ctsu_state_t    ctsu_state;
    bool            chg_method=false;


    /* Make sure scan is not currently running */

    r_ctsu_control_private(CTSU_PCMD_DISABLE_CTSU_INTS, g_method_stor, NULL);
    R_CTSU_Control(CTSU_CMD_GET_STATE, g_method_stor, &ctsu_state);
    if (CTSU_STATE_READY == ctsu_state)
    {
        g_last_method = g_method_stor;

        /* Verify scan completed successfully (no hardware errors) */
        R_CTSU_Control(CTSU_CMD_GET_STATUS, g_method_stor, &ctsu_status);
        if (1 == ctsu_status.flag.data_update)
        {
            /* update moving average for sensors */
            touch_data_moving_average(g_method_stor);

            /* save raw scan data */
            if (TOUCH_SELF_MODE == g_key_info[g_method_stor].mode)
            {
                memcpy(g_self_raw_data_pt[g_method_stor], g_self_ico_data_pt[g_method_stor], sizeof(self_ico_t) * g_key_info[g_method_stor].ena_num );
            }
            else
            {
                memcpy(g_mutual_raw_data_pt[g_method_stor], g_mutual_ico_data_pt[g_method_stor], sizeof(mutual_ico_t) * g_key_info[g_method_stor].ena_num );
            }

            r_ctsu_control_private(CTSU_PCMD_ENABLE_CTSU_INTS, g_method_stor, NULL);

            /* if this method has completed offset tuning, update touch judgments for all sensors */
            if (1 == g_touch_function[g_method_stor].flag.tuning)
            {
                R_Set_Cap_Touch_Result_Create(g_method_stor);
            }
#if (TOUCH_CFG_UPDATE_MONITOR == 1)
            monitor_update_data();
#endif
        }
        else
        {
            err = get_ctsu_err(g_method_stor, ctsu_status);
        }


        /* set next method as needed */

        if (true == g_cycle_methods)
        {
            /* set method to next in local list */
            g_mlist.cur_index++;
            if (g_mlist.cur_index >= g_mlist.num_methods)
            {
                g_mlist.cur_index = 0;
            }

            g_method_stor = g_mlist.methods[g_mlist.cur_index];
            chg_method = true;
        }
        else if (g_method_stor != g_set_method)
        {
            /* set method to specific method */
            g_method_stor = g_set_method;
            chg_method = true;
        }
        else
        {
            ;   /* leave current method running */
        }

        if (true == chg_method)
        {
            R_CTSU_Control(CTSU_CMD_SET_METHOD, g_method_stor, NULL);
            gp_sliderInfo = gp_touch_configs[g_method_stor]->p_sliders;
            gp_wheelInfo = gp_touch_configs[g_method_stor]->p_wheels;
        }


        correction_sensor_magnification_set(g_method_stor);
    }
    else
    {
        r_ctsu_control_private(CTSU_PCMD_ENABLE_CTSU_INTS, g_method_stor, NULL);
        err = QE_ERR_BUSY;
    }

    return err;

} /* End of function update_data() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_sensor_magnification_set
* Description  :
* Arguments    : uint8_t method    : Measurement method(0-8)
* Return Value : none
***********************************************************************************************************************/
static qe_err_t correction_sensor_magnification_set(uint8_t method)
{
    uint8_t    loop;
    uint8_t    pt;
    uint16_t   snum;
    uint16_t   spda;
    uint16_t   mea_freq;
    uint16_t   ts_measure_time;
    uint16_t   reg_value;
    qe_err_t   err = QE_SUCCESS;


    /* loop through each element for the method */
    for (loop = 0, pt = 1; loop < g_key_info[method].ena_num; loop++)
    {
        R_CTSU_ReadReg(CTSU_REG_SO0, loop, &reg_value);
        snum = ((reg_value & 0xFC00) >> 10);
        R_CTSU_ReadReg(CTSU_REG_SO1, loop, &reg_value);
        spda = ((reg_value & 0x1F00) >> 8);

