NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
        mea_freq = (CTSU_INPUT_FREQUENCY_DIV * 10) / ((spda + 1) * 2);

        switch (mea_freq)
        {
            case 40:                                        /* snum=7   4.0MHz    32MHz / 8     24MHz / 6  */
            {
                ts_measure_time =  625 * (snum + 1);
                break;
            }
            case 33:                                        /* snum=7   3.3MHz    27MHz / 8  */
            {
                ts_measure_time =  750 * (snum + 1);
                break;
            }
            case 20:                                        /* snum=3   2.0MHz    32MHz / 16    24MHz / 12  */
            {
                ts_measure_time = 1250 * (snum + 1);
                break;
            }
            case 16:                                        /* snum=3   1.6MHz    27MHz / 16 */
            {
                ts_measure_time = 1500 * (snum + 1);
                break;
            }
            case 10:                                        /* snum=1   1.0MHz    32MHz / 32    24MHz / 24  */
            {
                ts_measure_time = 2500 * (snum + 1);
                break;
            }
            case 8:                                         /* snum=1   0.8MHz    27MHz / 32 */
            {
                ts_measure_time = 3000 * (snum + 1);
                break;
            }
            case 5:                                         /* snum=0   0.5MHz    32MHz / 64    24MHz / 48  */
            {
                ts_measure_time = 5000 * (snum + 1);
                break;
            }
            case 4:                                         /* snum=0   0.4MHz    27MHz / 64 */
            {
                ts_measure_time = 6000 * (snum + 1);
                break;
            }
            default:
            {
                err = QE_ERR_UNSUPPORTED_CLK_CFG;
                break;
            }
        }

        if (QE_SUCCESS == err)
        {
            if (5000 <= ts_measure_time)
            {
                /* cast to byte for less memory usage */
                *(g_key_info[method].counter_magni + loop) = (int8_t)(ts_measure_time / 500);
            }
            else
            {
                /* cast to byte for less memory usage */
                *(g_key_info[method].counter_magni + loop) = (int8_t)((50000 / ts_measure_time) * (-1));
            }
        }
        pt = pt + 3;
    }

    return err;
}    /* End of function correction_sensor_magnification_set() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_Get_Cap_Touch_Sensor_Data
* Description  : Sensor data get
* Arguments    : uint8_t  method     : Measurement method number(0-8)
*              : uint8_t  mode       : Function mode
*              : uint8_t  index_num  : Sensor number
* Return Value : uint16_t data       : Sensor data
***********************************************************************************************************************/
static uint16_t R_Get_Cap_Touch_Sensor_Data( uint8_t method, uint8_t mode, uint8_t index_num )
{
    uint16_t data;

    switch (mode)
    {
        case TOUCH_PRV_0_BUTTON:
        {
            data = *(g_self_sensor_cnt_pt[method] + (*(g_key_info[method].sensor_index + index_num)));
            break;
        }
        case TOUCH_PRV_2_SLIDER:
        {
            data = *(g_self_sensor_cnt_pt[method] + index_num);
            break;
        }
        case TOUCH_PRV_3_WHEEL:
        {
            data = *(g_self_sensor_cnt_pt[method] + index_num);
            break;
        }
        case TOUCH_PRV_1_MATRIX:
        {
            data = *(g_mutual_sensor_diff_pt[method] + index_num);
            break;
        }
        default:
        {
            data = 0xFFFF;
            break;
        }
    }
    return data;
} /* End of function R_Get_Cap_Touch_Sensor_Data() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_Set_Cap_Touch_Result_Create
* Description  : 
* Arguments    : uint8_t method    : Measurement method number(0-8)
* Return Value : uint8_t status    : TOUCH_PRV_0_SUCCESS
*              :                   : TOUCH_PRV_1_ERROR
***********************************************************************************************************************/
static uint16_t R_Set_Cap_Touch_Result_Create( uint8_t method )
{
    uint8_t  loop;
#if (QE_MAX_SLIDERS != 0)
    uint8_t     slider_id;
#endif
#if (QE_MAX_WHEELS != 0)
    uint8_t     wheel_id;
#endif
#if ((QE_MAX_SLIDERS != 0) || (QE_MAX_WHEELS != 0))
    uint16_t    pos_value;
#endif
    uint16_t    sensor_val;
    uint16_t    status;


    status = TOUCH_PRV_1_ERROR;

    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        if (0 != g_key_info[method].key_num)
        {
            for (loop = 0; loop < MCU_MAX_SENSORS; loop++)
            {
                if (KEY_ENABLE == touch_key_function_check( method, loop))
                {
                    sensor_val = R_Get_Cap_Touch_Sensor_Data(method, TOUCH_PRV_0_BUTTON, loop);
                    touch_key_decode(method, sensor_val, loop);
                }
            }

            for (loop = 0; loop < g_key_info[method].key_max_group; loop++)
            {
                g_touch_all_result[method].button[loop]  = *(g_key_info[method].touch_result  + loop);
                status = TOUCH_PRV_0_SUCCESS;
            }
        }

#if (QE_MAX_SLIDERS != 0)
        if (0 != gp_touch_configs[method]->num_sliders)
        {
            for (slider_id = 0; slider_id < gp_touch_configs[method]->num_sliders; slider_id++)
            {
                for (loop = 0; loop < gp_sliderInfo[slider_id].num_elements; loop++)
                {
                    sensor_val = R_Get_Cap_Touch_Sensor_Data(method, TOUCH_PRV_2_SLIDER, gp_sliderInfo[slider_id].elem_index[loop]);
                    g_slider_data[loop]  = sensor_val;
                }
                pos_value = slider_decode( slider_id );
                g_touch_all_result[method].slider[slider_id] = pos_value;
                status = TOUCH_PRV_0_SUCCESS;
            }
        }
#endif

#if (QE_MAX_WHEELS != 0)
        if (gp_touch_configs[method]->num_wheels != 0)
        {
            for (wheel_id = 0; wheel_id < gp_touch_configs[method]->num_wheels; wheel_id++)
            {
                for (loop = 0; loop < gp_wheelInfo[wheel_id].num_elements; loop++)
                {
                    sensor_val = R_Get_Cap_Touch_Sensor_Data(method, TOUCH_PRV_3_WHEEL, gp_wheelInfo[wheel_id].elem_index[loop]);
                    g_wheel_data[loop] = sensor_val;
                }
                pos_value = wheel_decode( wheel_id );
                g_touch_all_result[method].wheel[wheel_id] = pos_value;
                status = TOUCH_PRV_0_SUCCESS;
            }
        }
#endif

