NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
    }
    else
    {
        if (0 != g_key_info[method].key_num)
        {
            for (loop = 0; loop < g_key_info[method].ena_num; loop++)
            {
                sensor_val = R_Get_Cap_Touch_Sensor_Data(method, TOUCH_PRV_1_MATRIX, loop);
                touch_key_decode(method, sensor_val, loop);
            }

            for (loop = 0; loop < g_key_info[method].key_max_group; loop++)
            {
                g_touch_all_result[method].matrix[loop]  = *(g_key_info[method].touch_result  + loop);
                status = TOUCH_PRV_0_SUCCESS;
            }
        }
    }


    return status;
}    /* End of function R_Set_Cap_Touch_Result_Create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: touch_data_moving_average
* Description  : touch data moving average
* Arguments    : uint8_t method    : Measurement method : 0-8
* Return Value : none
***********************************************************************************************************************/
static void touch_data_moving_average( uint8_t method )
{
    uint8_t     pt;
    uint8_t     offset;
    uint32_t    correction_work;
    uint32_t    correction_work2;
    uint32_t    scount_work;
    uint32_t    scount_work2;

    offset  = 0;

    for (pt = 0; pt < g_key_info[method].ena_num; pt++)
    {
        if (0 == g_touch_function[method].flag.average)
        {
            if (TOUCH_SELF_MODE == g_key_info[method].mode)
            {
                *(g_self_add_sensor_pt[method]  + pt) = correction_sensor_cnt_create( method, pt, (pt + offset));
            }
            else
            {
                *(g_mutual_add_pri_sensor_pt[method]  + pt) = correction_pri_sensor_cnt_create( method, pt, (pt + offset));
                *(g_mutual_add_snd_sensor_pt[method]  + pt) = correction_snd_sensor_cnt_create( method, pt, (pt + offset));
            }
        }
        else
        {
            if (TOUCH_SELF_MODE == g_key_info[method].mode)
            {
                scount_work      = *(g_self_add_sensor_pt[method]  + pt);                   /* Get Add data            */
                scount_work     -= (scount_work / TOUCH_PRV_ADD_TIME);                      /* Average / TOUCH_PRV_ADD_TIME      */
                correction_work  = correction_sensor_cnt_create( method, pt,(pt + offset));
                scount_work     += (correction_work / TOUCH_PRV_ADD_TIME);                  /* Add Now data / TOUCH_PRV_ADD_TIME */
               *(g_self_add_sensor_pt[method]  + pt) = scount_work;                         /* Data store for next     */
            }
            else
            {
                scount_work      = *(g_mutual_add_pri_sensor_pt[method]  + pt);             /* Get Add data            */
                scount_work2     = *(g_mutual_add_snd_sensor_pt[method]  + pt);             /* Get Add data            */
                scount_work     -= (scount_work   / TOUCH_PRV_ADD_TIME);                    /* Average / TOUCH_PRV_ADD_TIME      */
                scount_work2    -= (scount_work2  / TOUCH_PRV_ADD_TIME);                    /* Average / TOUCH_PRV_ADD_TIME      */
                correction_work  = correction_pri_sensor_cnt_create( method, pt, (pt + offset));
                correction_work2 = correction_snd_sensor_cnt_create( method, pt, (pt + offset));
                scount_work     += (correction_work   / TOUCH_PRV_ADD_TIME);                /* Add Now data / TOUCH_PRV_ADD_TIME */
                scount_work2    += (correction_work2  / TOUCH_PRV_ADD_TIME);                /* Add Now data / TOUCH_PRV_ADD_TIME */
               *(g_mutual_add_pri_sensor_pt[method]    + pt) = scount_work;                 /* Data store for next     */
               *(g_mutual_add_snd_sensor_pt[method]    + pt) = scount_work2;                /* Data store for next     */
            }
        }

        if (TOUCH_SELF_MODE == g_key_info[method].mode)
        {
             *(g_self_sensor_cnt_pt[method]    + pt) = *(g_self_add_sensor_pt[method]    + pt);
             offset = offset + 1;
        }
        else
        {
            if ((*(g_mutual_add_snd_sensor_pt[method] + (pt))) > (*(g_mutual_add_pri_sensor_pt[method] + (pt))))
            {
                *(g_mutual_sensor_diff_pt[method] + pt) = ((*(g_mutual_add_snd_sensor_pt[method] + (pt))) - (*(g_mutual_add_pri_sensor_pt[method] + (pt))));
            }
            else
            {
                 *(g_mutual_sensor_diff_pt[method] + pt) = 0;
            }
            offset = offset + 3;
        }
    }

    if ( 0 == g_touch_function[method].flag.average)
    {
        g_touch_function[method].flag.average = 1;
    }
}    /* End of function touch_data_moving_average() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_sensor_cnt_create
* Description  :
* Arguments    : uint8_t method    : Maeasurement method : 0-8
*              : uint8_t number    : Key number
* Return Value : none
***********************************************************************************************************************/
static uint16_t correction_sensor_cnt_create( uint8_t method, uint8_t ts_num, uint8_t number)
{
    uint8_t  loop;
    uint8_t  loop_coef;
    uint32_t cmp_val;
    uint32_t correct_box;
    uint32_t correct_box2;
    uint16_t correction_sensor_cnt;

    if ( 0 > (*(g_key_info[method].counter_magni + ts_num)))
    {
        cmp_val     = (*(g_self_ico_sensor_pt[method] + number)) * ((*(g_key_info[method].counter_magni + ts_num)) * (-1));
        cmp_val     =  cmp_val / 10;
        correct_box = *(g_self_ico_sensor_pt[method] + number);
    }
    else
    {
        cmp_val     = ((*(g_self_ico_sensor_pt[method] + number)) * 10) / (*(g_key_info[method].counter_magni + ts_num));
        correct_box = *(g_self_ico_sensor_pt[method] + number);
    }

    if (g_linear_interpolation_table[59] > cmp_val)
    {
        correct_box2          = correct_box * g_linear_interpolation_coefficient[0];
        correct_box2          = correct_box2 >> 10;         /* Unscaling corrected value */

        if(0x0000FFFF < correct_box2)
        {
            correct_box2 = 0x0000FFFF;                      /* 16bit length overflow limiter */
        }

