NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
        /* save count */
        correction_sensor_cnt = (uint16_t)correct_box2;
    }
    else
    {
        if (g_linear_interpolation_table[29] <= cmp_val)
        {
            if (g_linear_interpolation_table[14] <= cmp_val)
            {
                for (loop = 0, loop_coef = 60; loop < 15; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2         = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2         = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /* save count */
                        correction_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
            else
            {
                for (loop = 15, loop_coef = 45; loop < 30; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2         = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2         = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /* save count */
                        correction_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
        }
        else
        {
            if (g_linear_interpolation_table[44] <= cmp_val)
            {
                for (loop = 30, loop_coef = 30; loop < 45; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2         = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2         = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /* save count */
                        correction_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
            else
            {
                for (loop = 45, loop_coef = 15; loop < 60; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2         = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2         = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /*save count */
                        correction_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
        }
    }

    return correction_sensor_cnt;

}    /* End of function correction_sensor_cnt_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_pri_sensor_cnt_create
* Description  :
* Arguments    : uint8_t method    : Maeasurement method : 0-8
*              : uint8_t number    : Key number
* Return Value : none
***********************************************************************************************************************/
static uint16_t correction_pri_sensor_cnt_create( uint8_t method, uint8_t ts_num, uint8_t number)
{
    uint8_t  loop;
    uint8_t  loop_coef;
    uint32_t cmp_val;
    uint32_t correct_box;
    uint32_t correct_box2;
    uint16_t correction_pri_sensor_cnt;

    if ( 0 > (*(g_key_info[method].counter_magni + ts_num)))
    {
        cmp_val     = (*(g_mutual_ico_pri_sensor_pt[method] + number)) * ((*(g_key_info[method].counter_magni + ts_num)) * (-1));
        cmp_val     =  cmp_val / 10;
        correct_box = *(g_mutual_ico_pri_sensor_pt[method] + number);
    }
    else
    {
        cmp_val     = ((*(g_mutual_ico_pri_sensor_pt[method] + number)) * 10) / (*(g_key_info[method].counter_magni + ts_num));
        correct_box = *(g_mutual_ico_pri_sensor_pt[method] + number);
    }

    if (g_linear_interpolation_table[59] > cmp_val)
    {
        correct_box2              = correct_box * g_linear_interpolation_coefficient[0];
        correct_box2              = correct_box2 >> 10;     /* Unscaling corrected value */

        if(0x0000FFFF < correct_box2)
        {
            correct_box2 = 0x0000FFFF;                      /* 16bit length overflow limiter */
        }

        /* save count */
        correction_pri_sensor_cnt = (uint16_t)correct_box2;
    }
    else
    {
        if (g_linear_interpolation_table[29] <= cmp_val)
        {
            if (g_linear_interpolation_table[14] <= cmp_val)
            {
                for (loop = 0, loop_coef = 60; loop < 15; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2              = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2              = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

