NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
                        /* save count */
                        correction_snd_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
        }
        else
        {
            if (g_linear_interpolation_table[44] <= cmp_val)
            {
                for (loop = 30, loop_coef = 30; loop < 45; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2              = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2              = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /* save count */
                        correction_snd_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
            else
            {
                for (loop = 45, loop_coef = 15; loop < 60; loop++)
                {
                    if (g_linear_interpolation_table[loop] <= cmp_val)
                    {
                        correct_box2              = correct_box * g_linear_interpolation_coefficient[loop_coef];
                        correct_box2              = correct_box2 >> 10;

                        if(0x0000FFFF < correct_box2)
                        {
                            correct_box2 = 0x0000FFFF;
                        }

                        /* save count */
                        correction_snd_sensor_cnt = (uint16_t)correct_box2;
                        break;
                    }
                    loop_coef = loop_coef - 1;
                }
            }
        }
    }

    return correction_snd_sensor_cnt;

}    /* End of function correction_snd_sensor_cnt_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: r_touch_control_private
* Description  : This function is used to perform special operations internal to the driver and is not available
*                for public use.
* Arguments    : cmd -
*                    TOUCH_PCMD_PERFORM_OFFSET_TUNING
*                       Performs offset tuning and sets reference count for all methods
*                    TOUCH_PCMD_CLEAR_TUNING_FLAGS
*                       Clears tuning flags so can perform offset tuning again if desired.
*                p_arg -
*                    Pointer to command-specific argument.
*                    TOUCH_PCMD_PERFORM_OFFSET_TUNING........    (none)
*                    TOUCH_PCMD_CLEAR_TUNING_FLAGS...........    (none)
*
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    Command is invalid.
*                ** For OFFSET TUNING only **
*                QE_ERR_BUSY -
*                    CTSU busy. Likely this function called via main loop (outside Open) while another scan is running.
*                QE_ERR_UNSUPPORTED_CLK_CFG-
*                    Unsupported clock configuration.
*                QE_ERR_ABNORMAL_TSCAP-
*                    TSCAP error detected during scan
*                QE_ERR_SENSOR_OVERFLOW-
*                    Sensor overflow detected during scan
*                QE_ERR_OT_MAX_OFFSET -
*                    Cannot tune SO0 offset any higher
*                QE_ERR_OT_MIN_OFFSET -
*                    Cannot tune SO0 offset any lower
*                QE_ERR_OT_WINDOW_SIZE -
*                    Tuning window too small. SO0 adjustments keep counts outside of window.
*                QE_ERR_OT_MAX_ATTEMPTS -
*                    Maximum scans performed and all sensors still not in target window.
***********************************************************************************************************************/
static qe_err_t r_touch_control_private(touch_pcmd_t pcmd, void *p_arg)
{
    qe_err_t        err=QE_SUCCESS;
    uint8_t         i;
    uint8_t         j;


    switch (pcmd)
    {
        case TOUCH_PCMD_CLEAR_TUNING_FLAGS:
        {
            for (i=0; i < g_open_num_methods; i++)
            {
                for (j=0; j < gp_ctsu_configs[i]->num_elements; j++)
                {
                    g_touch_tuning_info[i].result[j] = 0;   // window tune count
                    g_touch_tuning_info[i].ctsuso[j] = 0;   // tuning direction
                }

                g_touch_function[i].flag.tuning = 0;        // show method not tuned
                g_touch_function[i].flag.average = 0;       // show method has no running average
            }

            break;
        }

        case TOUCH_PCMD_PERFORM_OFFSET_TUNING:
        {
            /* WARNING! BUSY will be returned if a scan is in progress when this is called.
             *          Be sure to set CTSU method to desired method when this completes,
             *            have the Touch method correspond, and ensure cycling/non-cycling
             *            is set up as needed.
             */
            for (i=0; (i < g_open_num_methods) && (QE_SUCCESS == err); i++)
            {
                err = R_CTSU_Control(CTSU_CMD_SET_METHOD, i, NULL);
                if (QE_SUCCESS == err)
                {
                    err = method_offset_tuning(i);
                }
            }

            break;
        }

        /* FUTURE: TOUCH_PCMD_GET_MONITORING_INFO to support stand-alone monitor
         * loads p_arg structure with:
         *   g_mon_req_buf address, MON_REQ_BUF_SIZE, g_mon_reply_buf address, and MON_REPLY_BUF_SIZE
         * Enclose this case with #if (TOUCH_CFG_UPDATE_MONITOR == 1) conditional compile
         * "Connection" software will use this information to transfer messages over USB or UART
         *   between these buffers and remote monitor.
         */
        default:
        {
            err = QE_ERR_INVALID_ARG;
            break;
        }
    }

