NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
    return err;
} /* End of function r_touch_control_private() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_Control
* Description  : This function is used to perform special operations.
* Arguments    : cmd -
*                    TOUCH_CMD_SET_METHOD:
*                       Stops cycling through methods if was cycling.
*                       Sets "method" to only method to scan going forward.
*                    TOUCH_CMD_CYCLE_ALL_METHODS:
*                       Starts cycling through all methods beginning with the method after the currently running one.
*                    TOUCH_CMD_CYCLE_METHOD_LIST:
*                       Starts cycling through specified list of methods only.
*                    TOUCH_CMD_GET_FAILED_SENSOR:
*                       Loads correction or offset tuning error details after Open() failure.
*                    TOUCH_CMD_CLEAR_TOUCH_STATES:
*                       Sets all touch states and related counters to 0 for specified method.
*                p_arg -
*                    Pointer to command-specific argument.
*                    TOUCH_CMD_SET_METHOD               uint8_t *
*                    TOUCH_CMD_CYCLE_ALL_METHODS        (none)
*                    TOUCH_CMD_CYCLE_METHOD_LIST        touch_mlist_t *
*                    TOUCH_CMD_GET_FAILED_SENSOR        touch_sensor_t *
*                    TOUCH_CMD_GET_LAST_SCAN_METHOD     uint8_t *
*                    TOUCH_CMD_CLEAR_TOUCH_STATES       uint8_t *
*
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_NULL_PTR -
*                    Missing required argument.
*                QE_ERR_INVALID_ARG -
*                    Command, method number, or number of methods is invalid.
***********************************************************************************************************************/
qe_err_t R_TOUCH_Control(touch_cmd_t cmd, void *p_arg)
{
    uint8_t         *p_set_method=(uint8_t *)p_arg;
    touch_mlist_t   *p_list=(touch_mlist_t *)p_arg;
    touch_sensor_t  *p_bad_sensor=(touch_sensor_t *)p_arg;
    uint8_t         *p_last_method=(uint8_t *)p_arg;
    uint8_t         *p_clr_states_method=(uint8_t *)p_arg;

    qe_err_t        err=QE_SUCCESS;
    uint8_t         i;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((TOUCH_CMD_CYCLE_ALL_METHODS != cmd) && (NULL == p_arg))
    {
        return QE_ERR_NULL_PTR;
    }

    if ((cmd >= TOUCH_CMD_END_ENUM)
     || (((TOUCH_CMD_SET_METHOD == cmd) || (TOUCH_CMD_CLEAR_TOUCH_STATES == cmd))
     && ((*p_set_method) >= g_open_num_methods)))
    {
        return QE_ERR_INVALID_ARG;
    }

    if (TOUCH_CMD_CYCLE_METHOD_LIST == cmd)
    {
        if (p_list->num_methods > g_open_num_methods)
        {
            return QE_ERR_INVALID_ARG;
        }

        for (i=0; i < p_list->num_methods; i++)
        {
            if (p_list->methods[i] >= g_open_num_methods)
            {
                return QE_ERR_INVALID_ARG;
            }
        }
    }
#endif

    switch (cmd)
    {
        case TOUCH_CMD_GET_FAILED_SENSOR:
        {
            *p_bad_sensor = g_bad_sensor;       // structure value assignment
            break;
        }
        case TOUCH_CMD_CLEAR_TOUCH_STATES:
        {
            /* clear buttons */
            for (i=0; i < g_key_info[*p_clr_states_method].key_num; i++)
            {
                g_key_info[*p_clr_states_method].touch_cnt[i] = 0;
                g_key_info[*p_clr_states_method].non_touch_cnt[i] = 0;
            }

            for (i=0; i < g_key_info[*p_clr_states_method].key_max_group; i++)
            {
                g_key_info[*p_clr_states_method].in_touch[i] = 0;
                g_key_info[*p_clr_states_method].out_touch[i] = 0;
                g_key_info[*p_clr_states_method].touch_result[i] = 0;
            }

            /* clear sliders and wheels */
#if (QE_MAX_SLIDERS != 0)
            for (i=0; i < gp_touch_configs[*p_clr_states_method]->num_sliders; i++)
            {
                gp_touch_configs[*p_clr_states_method]->p_sliders[i].value = 0xFFFF;
            }
#endif
#if (QE_MAX_WHEELS != 0)
            for (i=0; i < gp_touch_configs[*p_clr_states_method]->num_wheels; i++)
            {
                gp_touch_configs[*p_clr_states_method]->p_wheels[i].value = 0xFFFF;
            }
#endif
            break;
        }
        case TOUCH_CMD_SET_METHOD:
        {
            g_set_method = *p_set_method;
            g_cycle_methods = false;

            /* for monitor use */
            g_mlist.num_methods = 1;
            g_mlist.methods[0] = *p_set_method;
            break;
        }
        case TOUCH_CMD_CYCLE_ALL_METHODS:
        {
            /* set local list to all methods in Open() */
            for (i=0; i < g_open_num_methods; i++)
            {
                g_mlist.methods[i] = i;
            }

            g_mlist.num_methods = g_open_num_methods;
            g_mlist.cur_index = g_method_stor;
            g_cycle_methods = true;
            break;
        }
        case TOUCH_CMD_CYCLE_METHOD_LIST:
        {
            /* set local list to specified list */
            memcpy(&g_mlist, p_list, sizeof(touch_mlist_t));
            g_mlist.cur_index = 0;
            g_cycle_methods = true;
            break;
        }
        case TOUCH_CMD_GET_LAST_SCAN_METHOD:
        {
            *p_last_method = g_last_method;
            break;
        }
        default:
        {
            err = QE_ERR_INVALID_ARG;
            break;
        }
    }

    return err;
} /* End of function R_TOUCH_Control() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetRawData
* Description  : This function gets the sensor values as scanned by the CTSU (correction and filter not applied).
* Arguments    : method -
*                    Method to get data for.
*                p_buf -
*                    Pointer to buffer to load data into.
*                p_cnt -
*                    Pointer to variable to load number of of words loaded into buffer.
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "method" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_buf" or "p_cnt" is NULL.
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetRawData(uint8_t method, uint16_t *p_buf, uint8_t *p_cnt)
{
    uint8_t         i;
    self_ico_t      *p_self_data;
    mutual_ico_t    *p_mutual_data;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (method >= g_open_num_methods)
    {
        return QE_ERR_INVALID_ARG;
    }

    if ((NULL == p_buf) || (NULL == p_cnt))
    {
        return QE_ERR_NULL_PTR;
    }
#endif


    *p_cnt = g_key_info[method].ena_num;

    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        p_self_data = g_self_raw_data_pt[method];
        for (i=0; i < (*p_cnt); i++, p_self_data++)
        {
            *p_buf++ = p_self_data->sen;
        }
    }
    else
    {
        p_mutual_data = g_mutual_raw_data_pt[method];
        for (i=0; i < (*p_cnt); i++, p_mutual_data++)
        {
            *p_buf++ = p_mutual_data->pri_sen;
            *p_buf++ = p_mutual_data->snd_sen;
        }

        (*p_cnt) *= 2;
    }

    return QE_SUCCESS;
} /* End of function R_TOUCH_GetRawData() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetData
* Description  : This function gets the sensor values after correction and 4-deep moving average (filter) is applied.
* Arguments    : method -
*                    Method to get data for.
*                p_buf -
*                    Pointer to buffer to load data into.
*                p_cnt -
*                    Pointer to variable to load number of of words loaded into buffer.
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "method" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_buf" or "p_cnt" is NULL.
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetData(uint8_t method, uint16_t *p_buf, uint8_t *p_cnt)
{
    uint8_t     i;
    uint16_t    *p_data;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (method >= g_open_num_methods)
    {
        return QE_ERR_INVALID_ARG;
    }

    if ((NULL == p_buf) || (NULL == p_cnt))
    {
        return QE_ERR_NULL_PTR;
    }
#endif


    *p_cnt = g_key_info[method].ena_num;

    if (TOUCH_SELF_MODE == g_key_info[method].mode)
    {
        p_data = g_self_sensor_cnt_pt[method];
    }
    else
    {
        p_data = g_mutual_sensor_diff_pt[method];
    }

    for (i=0; i < (*p_cnt); i++)
    {
        *p_buf++ = *p_data++;
    }

    return QE_SUCCESS;
} /* End of function R_TOUCH_GetData() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetBtnBaselines
* Description  : This function gets the long term moving average values (values which touch judgment compares against)
*                for button elements only. The values are loaded into the buffer in their respective element index
*                locations (same as GetData()).
* Arguments    : method -
*                    Method to get data for.
*                p_buf -
*                    Pointer to buffer to load data into.
*                    (Non-button sensor locations are not loaded).
*                p_cnt -
*                    Pointer to variable to load word-size of buffer
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "method" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_buf" or "p_cnt" is NULL.
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetBtnBaselines(uint8_t method, uint16_t *p_buf, uint8_t *p_cnt)
{
    uint8_t     i;
    uint8_t     j;


#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (method >= g_open_num_methods)
    {
        return QE_ERR_INVALID_ARG;
    }

    if ((NULL == p_buf) || (NULL == p_cnt))
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    /* load expected size of buffer passed in */
    *p_cnt = g_key_info[method].ena_num;


    /* poke button baseline values into passed-in buffer */
    for (i=0; i < gp_touch_cfgs[method]->num_buttons; i++)
    {
        j = gp_touch_cfgs[method]->p_buttons[i].elem_index;     // get buffer index
        p_buf[j] = g_key_info[method].ref[i];                   // poke baseline value
    }

    return QE_SUCCESS;
} /* End of function R_TOUCH_GetBtnBaselines() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetAllBtnStates
* Description  : This function loads a 64-bit mask indicating which buttons are pressed.
* Arguments    : method -
*                    Method to get data for.
*                p_mask -
*                    Pointer to variable to load button-touched mask into. The masks are defined in the method-specific
*                    file named qe_<configuration name>.h.
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "method" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_mask" is NULL.
*                QE_ERR_OT_INCOMPLETE
*                    Offset tuning for method not complete
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetAllBtnStates(uint8_t method, uint64_t *p_mask)
{
    qe_err_t    err=QE_SUCCESS;
    uint64_t    mask;
    uint8_t     i;

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if (method >= g_open_num_methods)
    {
        return QE_ERR_INVALID_ARG;
    }

