NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_touch_qe/src/r_touch_qe.c
    if (NULL == p_mask)
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    if (1 != g_touch_function[method].flag.tuning)
    {
        err = QE_ERR_OT_INCOMPLETE;
    }
    else
    {
        mask = 0;

        /* .touch_result is the mask in a 16-bit array of .key_max_group size */
        for (i=0; i < g_key_info[method].key_max_group; i++)
        {
            /* convert array into single long long */
            mask |= ((uint64_t)(*(g_key_info[method].touch_result + i)) << (16 * i));
        }

        *p_mask = mask;
    }

    return err;
} /* End of function R_TOUCH_GetAllBtnStates() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetSliderPosition
* Description  : This function gets the current location of where a slider is being touched (if at all).
* Arguments    : slider_id -
*                    ID of slider to inspect. The ID is defined in the method-specific file named
*                    qe_<configuration name>.h.
*                p_position -
*                    Pointer to variable to load the slider position into.
*                    Position ranges from 0 (low) to 100 (high). 65535 implies slider is not being touched.
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "slider_id" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_position" is NULL.
*                QE_ERR_OT_INCOMPLETE
*                    Offset tuning for method not complete
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetSliderPosition(uint16_t slider_id, uint16_t *p_position)
{
    uint8_t     method;
    uint8_t     index;
    qe_err_t    err=QE_SUCCESS;

    method = slider_id >> 8;    // high byte of id is method
    index = slider_id & 0xFF;   // low byte of id is slider number/index for method

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((method >= g_open_num_methods)
     || (index >= gp_touch_configs[method]->num_sliders))
    {
        return QE_ERR_INVALID_ARG;
    }

    if (NULL == p_position)
    {
        return QE_ERR_NULL_PTR;
    }
#endif

    if (1 != g_touch_function[method].flag.tuning)
    {
        err = QE_ERR_OT_INCOMPLETE;
    }
    else
    {
        *p_position = gp_touch_configs[method]->p_sliders[index].value;
    }

    return err;
} /* End of function R_TOUCH_GetSliderPosition() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetWheelPosition
* Description  : This function gets the current location of where a wheel is being touched (if at all).
* Arguments    : wheel_id -
*                    ID of wheel to inspect. The ID is defined in the method-specific file named
*                    qe_<configuration name>.h.
*                p_position -
*                    Pointer to variable to load the wheel position into.
*                    Position ranges from 1 to 360 degrees. 65535 implies wheel is not being touched.
* Return Value : QE_SUCCESS -
*                    Command performed successfully.
*                QE_ERR_INVALID_ARG -
*                    "wheel_id" is invalid.
*                QE_ERR_NULL_PTR -
*                    "p_position" is NULL.
*                QE_ERR_OT_INCOMPLETE
*                    Offset tuning for method not complete
***********************************************************************************************************************/
qe_err_t R_TOUCH_GetWheelPosition(uint16_t wheel_id, uint16_t *p_position)
{
    uint8_t     method;
    uint8_t     index;
    qe_err_t    err=QE_SUCCESS;

    method = wheel_id >> 8;     // high byte of id is method
    index = wheel_id & 0xFF;    // low byte of id is slider number/index for method

#if (TOUCH_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((method >= g_open_num_methods)
     || (index >= gp_touch_configs[method]->num_wheels))
    {
        return QE_ERR_INVALID_ARG;
    }

    if (NULL == p_position)
    {
        return QE_ERR_NULL_PTR;
    }
#endif


    if (1 != g_touch_function[method].flag.tuning)
    {
        err = QE_ERR_OT_INCOMPLETE;
    }
    else
    {
        *p_position = gp_touch_configs[method]->p_wheels[index].value;
    }

    return err;
} /* End of function R_TOUCH_GetWheelPosition() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_Close
* Description  : This function closes the CapTouch driver. This requires no processing at the Touch layer. The hardware
*                is shut down at the CTSU layer.
* Arguments    : none
* Return Value : QE_SUCCESS -
*                    CTSU peripheral shut down successfully.
*                QE_ERR_BUSY
*                    Cannot run function because CTSU is performing an operation (likely scan in progress).
***********************************************************************************************************************/
qe_err_t R_TOUCH_Close(void)
{
    qe_err_t    err;

    err = R_CTSU_Close();

    return err;
} /* End of function R_TOUCH_Close() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_TOUCH_GetVersion
* Description  : Returns the current version of this module. The version number is encoded where the top 2 bytes are the
*                major version number and the bottom 2 bytes are the minor version number. For example, Version 4.25
*                would be returned as 0x00040019.
* Arguments    : none
* Return Value : Version of this module.
***********************************************************************************************************************/
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma inline(R_TOUCH_GetVersion)
#else
R_BSP_PRAGMA_INLINE(R_TOUCH_GetVersion)
#endif
uint32_t R_TOUCH_GetVersion (void)
{
    /* These version macros are defined in r_flash_if.h. */
    return ((((uint32_t)QETOUCH_RX_VERSION_MAJOR) << 16) | (uint32_t)QETOUCH_RX_VERSION_MINOR);
} /* End of function R_TOUCH_GetVersion() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (TOUCH_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (TOUCH_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif

